backend/test-soap-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="NepalTelecom.AuthGateway">
      <Username>sdu</Username>
      <Password>sdu321*</Password>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <GenerateAuthPassword xmlns="NepalTelecom.AuthGateway">
      <MDN>9851347856</MDN>
      <Busicode>787878</Busicode>
    </GenerateAuthPassword>
  </soap:Body>
</soap:Envelope>